k6/meet/showup/k6_output_2025-04-17_14-41-29.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: showup_v1.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 10m30s max duration (incl. graceful stop):
              * test: 2 iterations for each of 50 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m01.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
test   [   0% ] 50 VUs  00m01.0s/10m0s  000/100 iters, 2 per VU

running (00m02.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
test   [   0% ] 50 VUs  00m02.0s/10m0s  000/100 iters, 2 per VU
time="2025-04-17T14:41:32+08:00" level=info msg="CSV_LINE:batch0025@batch.com.tw,測零零二五,271848,1,20250417 14:41:29,965.63,99.69," source=console
time="2025-04-17T14:41:32+08:00" level=info msg="CSV_LINE:batch0067@batch.com.tw,測零零六七,271890,2,20250417 14:41:29,959.88,160.64," source=console
time="2025-04-17T14:41:32+08:00" level=info msg="CSV_LINE:batch0015@batch.com.tw,測零零一五,271838,3,20250417 14:41:29,959.07,175.86," source=console
time="2025-04-17T14:41:32+08:00" level=info msg="CSV_LINE:batch0099@batch.com.tw,測零零九九,271922,4,20250417 14:41:29,1009.80,203.31," source=console
time="2025-04-17T14:41:32+08:00" level=info msg="CSV_LINE:batch0079@batch.com.tw,測零零七九,271902,5,20250417 14:41:29,1003.55,255.66," source=console
time="2025-04-17T14:41:32+08:00" level=info msg="CSV_LINE:batch0053@batch.com.tw,測零零五三,271876,7,20250417 14:41:29,1013.47,294.04," source=console
time="2025-04-17T14:41:32+08:00" level=info msg="CSV_LINE:batch0023@batch.com.tw,測零零二三,271846,6,20250417 14:41:29,1007.39,299.49," source=console
time="2025-04-17T14:41:32+08:00" level=info msg="CSV_LINE:batch0009@batch.com.tw,測零零零九,271832,9,20250417 14:41:29,1007.60,607.62," source=console
time="2025-04-17T14:41:32+08:00" level=info msg="CSV_LINE:batch0069@batch.com.tw,測零零六九,271892,8,20250417 14:41:29,1000.03,597.08," source=console
time="2025-04-17T14:41:32+08:00" level=info msg="CSV_LINE:batch0085@batch.com.tw,測零零八五,271908,11,20250417 14:41:29,1311.37,400.50," source=console
time="2025-04-17T14:41:32+08:00" level=info msg="CSV_LINE:batch0013@batch.com.tw,測零零一三,271836,10,20250417 14:41:29,1446.29,282.99," source=console
time="2025-04-17T14:41:32+08:00" level=info msg="CSV_LINE:batch0093@batch.com.tw,測零零九三,271916,12,20250417 14:41:29,1404.76,345.14," source=console
time="2025-04-17T14:41:32+08:00" level=info msg="CSV_LINE:batch0029@batch.com.tw,測零零二九,271852,13,20250417 14:41:29,1657.89,150.40," source=console

running (00m03.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
test   [   0% ] 50 VUs  00m03.0s/10m0s  000/100 iters, 2 per VU
time="2025-04-17T14:41:32+08:00" level=info msg="CSV_LINE:batch0083@batch.com.tw,測零零八三,271906,14,20250417 14:41:29,1657.55,163.89," source=console
time="2025-04-17T14:41:33+08:00" level=info msg="CSV_LINE:batch0087@batch.com.tw,測零零八七,271910,15,20250417 14:41:29,1763.65,271.09," source=console
time="2025-04-17T14:41:33+08:00" level=info msg="CSV_LINE:batch0019@batch.com.tw,測零零一九,271842,17,20250417 14:41:29,1827.01,444.05," source=console
time="2025-04-17T14:41:33+08:00" level=info msg="CSV_LINE:batch0061@batch.com.tw,測零零六一,271884,16,20250417 14:41:29,1804.17,647.14," source=console
time="2025-04-17T14:41:33+08:00" level=info msg="CSV_LINE:batch0049@batch.com.tw,測零零四九,271872,18,20250417 14:41:29,1808.65,763.74," source=console

running (00m04.0s), 50/50 VUs, 13 complete and 0 interrupted iterations
test   [  13% ] 50 VUs  00m04.0s/10m0s  013/100 iters, 2 per VU
time="2025-04-17T14:41:33+08:00" level=info msg="CSV_LINE:batch0033@batch.com.tw,測零零三三,271856,19,20250417 14:41:29,1834.49,1036.65," source=console
time="2025-04-17T14:41:34+08:00" level=info msg="CSV_LINE:batch0003@batch.com.tw,測零零零三,271826,20,20250417 14:41:29,1801.75,1206.45," source=console
time="2025-04-17T14:41:34+08:00" level=info msg="CSV_LINE:batch0047@batch.com.tw,測零零四七,271870,22,20250417 14:41:29,1831.36,1329.97," source=console
time="2025-04-17T14:41:34+08:00" level=info msg="CSV_LINE:batch0059@batch.com.tw,測零零五九,271882,21,20250417 14:41:29,1810.29,1375.20," source=console
time="2025-04-17T14:41:34+08:00" level=info msg="CSV_LINE:batch0026@batch.com.tw,測零零二六,271849,23,20250417 14:41:33,179.74,138.00," source=console
time="2025-04-17T14:41:34+08:00" level=info msg="CSV_LINE:batch0091@batch.com.tw,測零零九一,271914,24,20250417 14:41:29,1827.05,1735.61," source=console
time="2025-04-17T14:41:34+08:00" level=info msg="CSV_LINE:batch0039@batch.com.tw,測零零三九,271862,25,20250417 14:41:29,1813.21,1886.99," source=console
time="2025-04-17T14:41:34+08:00" level=info msg="CSV_LINE:batch0037@batch.com.tw,測零零三七,271860,26,20250417 14:41:29,1830.33,1923.13," source=console

running (00m05.0s), 50/50 VUs, 18 complete and 0 interrupted iterations
test   [  18% ] 50 VUs  00m05.0s/10m0s  018/100 iters, 2 per VU
time="2025-04-17T14:41:35+08:00" level=info msg="CSV_LINE:batch0055@batch.com.tw,測零零五五,271878,29,20250417 14:41:29,1811.17,2086.99," source=console
time="2025-04-17T14:41:35+08:00" level=info msg="CSV_LINE:batch0071@batch.com.tw,測零零七一,271894,27,20250417 14:41:29,1811.77,2133.81," source=console
time="2025-04-17T14:41:35+08:00" level=info msg="CSV_LINE:batch0035@batch.com.tw,測零零三五,271858,30,20250417 14:41:29,1807.17,2138.48," source=console
time="2025-04-17T14:41:35+08:00" level=info msg="CSV_LINE:batch0024@batch.com.tw,測零零二四,271847,28,20250417 14:41:33,309.59,372.65," source=console
time="2025-04-17T14:41:35+08:00" level=info msg="CSV_LINE:batch0100@batch.com.tw,測零一零零,271923,31,20250417 14:41:33,316.42,482.79," source=console
time="2025-04-17T14:41:35+08:00" level=info msg="CSV_LINE:batch0007@batch.com.tw,測零零零七,271830,32,20250417 14:41:29,1815.10,2196.48," source=console
time="2025-04-17T14:41:35+08:00" level=info msg="CSV_LINE:batch0077@batch.com.tw,測零零七七,271900,33,20250417 14:41:29,1809.05,2397.11," source=console
time="2025-04-17T14:41:35+08:00" level=info msg="CSV_LINE:batch0070@batch.com.tw,測零零七零,271893,35,20250417 14:41:33,397.87,228.76," source=console
time="2025-04-17T14:41:35+08:00" level=info msg="CSV_LINE:batch0045@batch.com.tw,測零零四五,271868,34,20250417 14:41:29,1801.37,2528.08," source=console
time="2025-04-17T14:41:35+08:00" level=info msg="CSV_LINE:batch0016@batch.com.tw,測零零一六,271839,36,20250417 14:41:33,1091.75,236.68," source=console
time="2025-04-17T14:41:35+08:00" level=info msg="CSV_LINE:batch0080@batch.com.tw,測零零八零,271903,37,20250417 14:41:33,267.97,952.32," source=console

running (00m06.0s), 49/50 VUs, 26 complete and 0 interrupted iterations
test   [  26% ] 50 VUs  00m06.0s/10m0s  026/100 iters, 2 per VU
time="2025-04-17T14:41:36+08:00" level=info msg="CSV_LINE:batch0075@batch.com.tw,測零零七五,271898,39,20250417 14:41:29,1807.58,3077.82," source=console
time="2025-04-17T14:41:36+08:00" level=info msg="CSV_LINE:batch0014@batch.com.tw,測零零一四,271837,43,20250417 14:41:33,313.44,1066.04," source=console
time="2025-04-17T14:41:36+08:00" level=info msg="CSV_LINE:batch0005@batch.com.tw,測零零零五,271828,41,20250417 14:41:29,1799.58,3287.10," source=console
time="2025-04-17T14:41:36+08:00" level=info msg="CSV_LINE:batch0051@batch.com.tw,測零零五一,271874,40,20250417 14:41:29,1823.19,3340.10," source=console
time="2025-04-17T14:41:36+08:00" level=info msg="CSV_LINE:batch0086@batch.com.tw,測零零八六,271909,42,20250417 14:41:33,322.30,1218.12," source=console
time="2025-04-17T14:41:36+08:00" level=info msg="CSV_LINE:batch0054@batch.com.tw,測零零五四,271877,44,20250417 14:41:33,952.20,1050.36," source=console
time="2025-04-17T14:41:36+08:00" level=info msg="CSV_LINE:batch0073@batch.com.tw,測零零七三,271896,45,20250417 14:41:29,1802.41,3567.73," source=console
time="2025-04-17T14:41:36+08:00" level=info msg="CSV_LINE:batch0017@batch.com.tw,測零零一七,271840,46,20250417 14:41:29,1823.14,3691.45," source=console
time="2025-04-17T14:41:36+08:00" level=info msg="CSV_LINE:batch0065@batch.com.tw,測零零六五,271888,47,20250417 14:41:29,1806.59,3727.48," source=console
time="2025-04-17T14:41:36+08:00" level=info msg="CSV_LINE:batch0084@batch.com.tw,測零零八四,271907,49,20250417 14:41:33,510.68,1264.31," source=console
time="2025-04-17T14:41:36+08:00" level=info msg="CSV_LINE:batch0041@batch.com.tw,測零零四一,271864,38,20250417 14:41:29,1826.61,3881.35," source=console
time="2025-04-17T14:41:36+08:00" level=info msg="CSV_LINE:batch0094@batch.com.tw,測零零九四,271917,48,20250417 14:41:33,573.93,1434.66," source=console
time="2025-04-17T14:41:36+08:00" level=info msg="CSV_LINE:batch0062@batch.com.tw,測零零六二,271885,51,20250417 14:41:34,84.03,1232.36," source=console

running (00m07.0s), 44/50 VUs, 37 complete and 0 interrupted iterations
test   [  37% ] 50 VUs  00m07.0s/10m0s  037/100 iters, 2 per VU
time="2025-04-17T14:41:36+08:00" level=info msg="CSV_LINE:batch0031@batch.com.tw,測零零三一,271854,50,20250417 14:41:29,1831.34,4033.48," source=console
time="2025-04-17T14:41:37+08:00" level=info msg="CSV_LINE:batch0081@batch.com.tw,測零零八一,271904,52,20250417 14:41:29,1811.98,4182.69," source=console
time="2025-04-17T14:41:37+08:00" level=info msg="CSV_LINE:batch0020@batch.com.tw,測零零二零,271843,53,20250417 14:41:34,162.58,1606.36," source=console
time="2025-04-17T14:41:37+08:00" level=info msg="CSV_LINE:batch0063@batch.com.tw,測零零六三,271886,54,20250417 14:41:29,1828.47,4488.02," source=console
time="2025-04-17T14:41:37+08:00" level=info msg="CSV_LINE:batch0048@batch.com.tw,測零零四八,271871,55,20250417 14:41:35,208.59,1024.85," source=console
time="2025-04-17T14:41:37+08:00" level=info msg="CSV_LINE:batch0089@batch.com.tw,測零零八九,271912,57,20250417 14:41:29,1810.00,4728.55," source=console
time="2025-04-17T14:41:37+08:00" level=info msg="CSV_LINE:batch0095@batch.com.tw,測零零九五,271918,56,20250417 14:41:29,1809.45,4808.03," source=console

running (00m08.0s), 38/50 VUs, 50 complete and 0 interrupted iterations
test   [  50% ] 50 VUs  00m08.0s/10m0s  050/100 iters, 2 per VU
time="2025-04-17T14:41:37+08:00" level=info msg="CSV_LINE:batch0097@batch.com.tw,測零零九七,271920,58,20250417 14:41:29,1809.16,5007.12," source=console
time="2025-04-17T14:41:37+08:00" level=info msg="CSV_LINE:batch0043@batch.com.tw,測零零四三,271866,60,20250417 14:41:29,1799.58,5020.44," source=console
time="2025-04-17T14:41:37+08:00" level=info msg="CSV_LINE:batch0088@batch.com.tw,測零零八八,271911,61,20250417 14:41:34,119.50,2775.61," source=console
time="2025-04-17T14:41:38+08:00" level=info msg="CSV_LINE:batch0021@batch.com.tw,測零零二一,271844,N/A,20250417 14:41:29,1807.55,5097.72,\"update API failed: 伺服器繁忙，無法取得正確序號\"" source=console
time="2025-04-17T14:41:38+08:00" level=info msg="CSV_LINE:batch0034@batch.com.tw,測零零三四,271857,59,20250417 14:41:34,931.87,1135.15," source=console
time="2025-04-17T14:41:38+08:00" level=info msg="CSV_LINE:batch0004@batch.com.tw,測零零零四,271827,62,20250417 14:41:35,1115.04,788.90," source=console
time="2025-04-17T14:41:38+08:00" level=info msg="CSV_LINE:batch0050@batch.com.tw,測零零五零,271873,63,20250417 14:41:34,131.82,2246.09," source=console
time="2025-04-17T14:41:38+08:00" level=info msg="CSV_LINE:batch0027@batch.com.tw,測零零二七,271850,N/A,20250417 14:41:29,1807.21,5209.44,\"update API failed: 伺服器繁忙，無法取得正確序號\"" source=console
time="2025-04-17T14:41:38+08:00" level=info msg="CSV_LINE:batch0060@batch.com.tw,測零零六零,271883,64,20250417 14:41:35,1133.15,753.52," source=console
time="2025-04-17T14:41:38+08:00" level=info msg="CSV_LINE:batch0001@batch.com.tw,測零零零一,270715,N/A,20250417 14:41:29,1809.30,5364.64,\"update API failed: 伺服器繁忙，無法取得正確序號\"" source=console
time="2025-04-17T14:41:38+08:00" level=info msg="CSV_LINE:batch0092@batch.com.tw,測零零九二,271915,66,20250417 14:41:35,989.23,662.79," source=console
time="2025-04-17T14:41:38+08:00" level=info msg="CSV_LINE:batch0040@batch.com.tw,測零零四零,271863,65,20250417 14:41:35,926.34,619.41," source=console
time="2025-04-17T14:41:38+08:00" level=info msg="CSV_LINE:batch0072@batch.com.tw,測零零七二,271895,67,20250417 14:41:36,141.04,1272.34," source=console
time="2025-04-17T14:41:38+08:00" level=info msg="CSV_LINE:batch0057@batch.com.tw,測零零五七,271880,N/A,20250417 14:41:29,1809.97,5564.39,\"update API failed: 伺服器繁忙，無法取得正確序號\"" source=console
time="2025-04-17T14:41:38+08:00" level=info msg="CSV_LINE:batch0078@batch.com.tw,測零零七八,271901,68,20250417 14:41:36,1042.65,175.52," source=console
time="2025-04-17T14:41:38+08:00" level=info msg="CSV_LINE:batch0011@batch.com.tw,測零零一一,271834,N/A,20250417 14:41:29,1801.16,5699.49,\"update API failed: 伺服器繁忙，無法取得正確序號\"" source=console
time="2025-04-17T14:41:38+08:00" level=info msg="CSV_LINE:batch0068@batch.com.tw,測零零六八,271891,70,20250417 14:41:33,1106.37,3470.53," source=console
time="2025-04-17T14:41:38+08:00" level=info msg="CSV_LINE:batch0056@batch.com.tw,測零零五六,271879,69,20250417 14:41:36,1009.26,748.09," source=console
time="2025-04-17T14:41:38+08:00" level=info msg="CSV_LINE:batch0036@batch.com.tw,測零零三六,271859,71,20250417 14:41:36,1025.41,706.14," source=console

running (00m09.0s), 36/50 VUs, 57 complete and 0 interrupted iterations
test   [  57% ] 50 VUs  00m09.0s/10m0s  057/100 iters, 2 per VU
time="2025-04-17T14:41:39+08:00" level=info msg="CSV_LINE:batch0038@batch.com.tw,測零零三八,271861,72,20250417 14:41:35,274.93,1949.63," source=console
time="2025-04-17T14:41:39+08:00" level=info msg="CSV_LINE:batch0066@batch.com.tw,測零零六六,271889,74,20250417 14:41:37,152.45,265.10," source=console
time="2025-04-17T14:41:39+08:00" level=info msg="CSV_LINE:batch0010@batch.com.tw,測零零一零,271833,73,20250417 14:41:33,397.83,3978.56," source=console
time="2025-04-17T14:41:39+08:00" level=info msg="CSV_LINE:batch0076@batch.com.tw,測零零七六,271899,77,20250417 14:41:37,894.73,236.73," source=console
time="2025-04-17T14:41:39+08:00" level=info msg="CSV_LINE:batch0030@batch.com.tw,測零零三零,271853,76,20250417 14:41:33,500.30,3798.93," source=console
time="2025-04-17T14:41:39+08:00" level=info msg="CSV_LINE:batch0046@batch.com.tw,測零零四六,271869,78,20250417 14:41:36,288.03,1588.39," source=console
time="2025-04-17T14:41:39+08:00" level=info msg="CSV_LINE:batch0082@batch.com.tw,測零零八二,271905,79,20250417 14:41:38,112.52,158.13," source=console
time="2025-04-17T14:41:39+08:00" level=info msg="CSV_LINE:batch0074@batch.com.tw,測零零七四,271897,75,20250417 14:41:37,97.84,871.61," source=console
time="2025-04-17T14:41:39+08:00" level=info msg="CSV_LINE:batch0052@batch.com.tw,測零零五二,271875,80,20250417 14:41:37,762.16,567.41," source=console
time="2025-04-17T14:41:39+08:00" level=info msg="CSV_LINE:batch0006@batch.com.tw,測零零零六,271829,81,20250417 14:41:37,1138.30,235.22," source=console
time="2025-04-17T14:41:39+08:00" level=info msg="CSV_LINE:batch0018@batch.com.tw,測零零一八,271841,82,20250417 14:41:37,735.40,471.39," source=console
time="2025-04-17T14:41:39+08:00" level=info msg="CSV_LINE:batch0032@batch.com.tw,測零零三二,271855,84,20250417 14:41:37,720.55,147.53," source=console
time="2025-04-17T14:41:39+08:00" level=info msg="CSV_LINE:batch0042@batch.com.tw,測零零四二,271865,83,20250417 14:41:37,677.38,339.44," source=console

running (00m10.0s), 24/50 VUs, 76 complete and 0 interrupted iterations
test   [  76% ] 50 VUs  00m10.0s/10m0s  076/100 iters, 2 per VU
time="2025-04-17T14:41:39+08:00" level=info msg="CSV_LINE:batch0008@batch.com.tw,測零零零八,271831,85,20250417 14:41:36,994.66,1794.02," source=console
time="2025-04-17T14:41:40+08:00" level=info msg="CSV_LINE:batch0064@batch.com.tw,測零零六四,271887,86,20250417 14:41:38,605.82,102.32," source=console
time="2025-04-17T14:41:40+08:00" level=info msg="CSV_LINE:batch0098@batch.com.tw,測零零九八,271921,87,20250417 14:41:38,210.36,96.61," source=console
time="2025-04-17T14:41:40+08:00" level=info msg="CSV_LINE:batch0090@batch.com.tw,測零零九零,271913,88,20250417 14:41:38,564.42,93.97," source=console
time="2025-04-17T14:41:40+08:00" level=info msg="CSV_LINE:batch0096@batch.com.tw,測零零九六,271919,89,20250417 14:41:38,596.69,100.14," source=console
time="2025-04-17T14:41:40+08:00" level=info msg="CSV_LINE:batch0022@batch.com.tw,測零零二二,271845,91,20250417 14:41:39,567.30,125.32," source=console
time="2025-04-17T14:41:40+08:00" level=info msg="CSV_LINE:batch0058@batch.com.tw,測零零五八,271881,92,20250417 14:41:39,135.75,117.33," source=console
time="2025-04-17T14:41:40+08:00" level=info msg="CSV_LINE:batch0044@batch.com.tw,測零零四四,271867,90,20250417 14:41:38,610.33,250.67," source=console
time="2025-04-17T14:41:40+08:00" level=info msg="CSV_LINE:batch0028@batch.com.tw,測零零二八,271851,93,20250417 14:41:39,554.57,163.18," source=console

running (00m11.0s), 11/50 VUs, 89 complete and 0 interrupted iterations
test   [  89% ] 50 VUs  00m11.0s/10m0s  089/100 iters, 2 per VU
time="2025-04-17T14:41:40+08:00" level=info msg="CSV_LINE:batch0012@batch.com.tw,測零零一二,271835,94,20250417 14:41:39,268.52,101.03," source=console
time="2025-04-17T14:41:41+08:00" level=info msg="CSV_LINE:batch0002@batch.com.tw,測零零零二,276833,95,20250417 14:41:39,614.52,122.31," source=console

running (00m12.0s), 02/50 VUs, 98 complete and 0 interrupted iterations
test   [  98% ] 50 VUs  00m12.0s/10m0s  098/100 iters, 2 per VU

     data_received..................: 292 kB  24 kB/s
     data_sent......................: 74 kB   6.1 kB/s
     http_req_blocked...............: avg=50.36ms    min=0s      med=1µs      max=231.51ms p(90)=215.69ms  p(95)=227.32ms 
     http_req_connecting............: avg=11.01ms    min=0s      med=0s       max=47.72ms  p(90)=44.24ms   p(95)=44.94ms  
     http_req_duration..............: avg=1.34s      min=84.03ms med=1s       max=5.69s    p(90)=3.29s     p(95)=4.19s    
       { expected_response:true }...: avg=1.34s      min=84.03ms med=1s       max=5.69s    p(90)=3.29s     p(95)=4.19s    
     http_req_failed................: 0.00%   0 out of 200
     http_req_receiving.............: avg=76.23µs    min=6µs     med=72µs     max=965µs    p(90)=126.2µs   p(95)=137.15µs 
     http_req_sending...............: avg=194.93µs   min=14µs    med=200.5µs  max=577µs    p(90)=388.1µs   p(95)=419.24µs 
     http_req_tls_handshaking.......: avg=33.17ms    min=0s      med=0s       max=160.32ms p(90)=147.7ms   p(95)=155.84ms 
     http_req_waiting...............: avg=1.34s      min=83.48ms med=1s       max=5.69s    p(90)=3.29s     p(95)=4.19s    
     http_reqs......................: 200     16.479926/s
     iteration_duration.............: avg=4.79s      min=2.25s   med=3.89s    max=9.73s    p(90)=8.25s     p(95)=9.05s    
     iterations.....................: 100     8.239963/s
     query_api_response_time........: avg=1094.74237 min=84.031  med=1009.527 max=1834.488 p(90)=1815.9033 p(95)=1827.1165
     query_api_success_rate.........: 100.00% 100 out of 100
     update_api_response_time.......: avg=1592.51646 min=93.965  med=988.584  max=5699.486 p(90)=4213.2261 p(95)=5024.3028
     update_api_success_rate........: 95.00%  95 out of 100
     vus............................: 2       min=2          max=50
     vus_max........................: 50      min=50         max=50


running (00m12.1s), 00/50 VUs, 100 complete and 0 interrupted iterations
test ✓ [ 100% ] 50 VUs  00m12.1s/10m0s  100/100 iters, 2 per VU